{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 3], "sparse": false, "dtype": "float32", "name": "anchor_input"}, "name": "anchor_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 3], "sparse": false, "dtype": "float32", "name": "positive_input"}, "name": "positive_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 3], "sparse": false, "dtype": "float32", "name": "input_2"}, "name": "input_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["anchor_input", 0, 0, {}]], [["positive_input", 0, 0, {}]], [["input_2", 0, 0, {}]]], "config": {"padding": "same", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "kernel_size": [4, 4], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "name": "conv2d_5", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "strides": [1, 1]}, "name": "conv2d_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]], [["conv2d_5", 1, 0, {}]], [["conv2d_5", 2, 0, {}]]], "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_5", "pool_size": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"padding": "same", "kernel_constraint": null, "filters": 32, "kernel_regularizer": null, "kernel_size": [4, 4], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "name": "conv2d_6", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "strides": [1, 1]}, "name": "conv2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 1, 0, {}]]], "config": {"padding": "same", "kernel_constraint": null, "filters": 32, "kernel_regularizer": null, "kernel_size": [4, 4], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "name": "conv2d_7", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "strides": [1, 1]}, "name": "conv2d_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 2, 0, {}]]], "config": {"padding": "same", "kernel_constraint": null, "filters": 32, "kernel_regularizer": null, "kernel_size": [4, 4], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "name": "conv2d_8", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "strides": [1, 1]}, "name": "conv2d_8"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_6", "pool_size": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_6"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_7", "pool_size": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_7"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_8", "pool_size": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_8"}, {"class_name": "Dense", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 20, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "name": "dense_4", "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}}, "name": "dense_4"}, {"class_name": "Dense", "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 20, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "name": "dense_5", "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}}, "name": "dense_5"}, {"class_name": "Dense", "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 20, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "name": "dense_6", "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}}, "name": "dense_6"}, {"class_name": "Flatten", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "anchor_output"}, "name": "anchor_output"}, {"class_name": "Flatten", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "positive_output"}, "name": "positive_output"}, {"class_name": "Flatten", "inbound_nodes": [[["dense_6", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "negative_output"}, "name": "negative_output"}, {"class_name": "TripletLossLayer", "inbound_nodes": [[["anchor_output", 0, 0, {}], ["positive_output", 0, 0, {}], ["negative_output", 0, 0, {}]]], "config": {"trainable": true, "name": "triplet_loss_layer"}, "name": "triplet_loss_layer"}], "name": "model_2", "input_layers": [["anchor_input", 0, 0], ["positive_input", 0, 0], ["input_2", 0, 0]], "output_layers": [["triplet_loss_layer", 0, 0]]}, "keras_version": "2.1.6"}